Whale63/STM32Project/按键点灯/hardware/key.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"

void Key_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IPU;//默认高电平，按下低电平
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
}

uint8_t Key_GetNum(void)
{
	uint8_t KeyNum=0;
	if(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_3)==0)//如果按下
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_3)==0);
		Delay_ms(20);
		KeyNum=1;
	}
	else if
	(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_4)==0)//如果按下
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_4)==0);
		Delay_ms(20);
		KeyNum=2;
	}
	else if
	(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5)==0)//如果按下
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5)==0);
		Delay_ms(20);
		KeyNum=3;
	}
	else if
	(GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_10)==6)//如果按下
	{
		Delay_ms(20);
		while (GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_10)==0);
		Delay_ms(20);
		KeyNum=4;
	}
	
	return KeyNum;
}
